import json

# 定义窗户位置和默认参数
windows = {
    "5楼阳台": {"推拉窗平方数": 0, "平开窗平方数": 11, "推拉窗开扇个数": 0, "平开窗开扇个数": 2, "转方角米数": 0},
    "5楼飘窗": {"推拉窗平方数": 0, "平开窗平方数": 6.7, "推拉窗开扇个数": 0, "平开窗开扇个数": 2, "转方角米数": 3.8},
    "5楼厨房": {"推拉窗平方数": 0, "平开窗平方数": 1.4, "推拉窗开扇个数": 0, "平开窗开扇个数": 1, "转方角米数": 0},
    "5楼厕所": {"推拉窗平方数": 0, "平开窗平方数": 1, "推拉窗开扇个数": 0, "平开窗开扇个数": 1, "转方角米数": 0},
    "5楼卧室": {"推拉窗平方数": 0, "平开窗平方数": 6.1, "推拉窗开扇个数": 0, "平开窗开扇个数": 2, "转方角米数": 0},
    "4-5楼平台": {"推拉窗平方数": 0, "平开窗平方数": 2, "推拉窗开扇个数": 0, "平开窗开扇个数": 1, "转方角米数": 0},
    "5-6楼平台": {"推拉窗平方数": 0, "平开窗平方数": 2, "推拉窗开扇个数": 0, "平开窗开扇个数": 1, "转方角米数": 0},
    "6楼主卧飘窗": {"推拉窗平方数": 0, "平开窗平方数": 6.7, "推拉窗开扇个数": 0, "平开窗开扇个数": 2, "转方角米数": 3.8},
    "6楼衣帽间": {"推拉窗平方数": 0, "平开窗平方数": 1.4, "推拉窗开扇个数": 0, "平开窗开扇个数": 1, "转方角米数": 0},
    "6楼厕所": {"推拉窗平方数": 0, "平开窗平方数": 1, "推拉窗开扇个数": 0, "平开窗开扇个数": 1, "转方角米数": 0},
    "6楼卧室推拉门": {"推拉窗平方数": 5, "平开窗平方数": 0, "推拉窗开扇个数": 0, "平开窗开扇个数": 0, "转方角米数": 0},
    "6楼书房推拉门": {"推拉窗平方数": 8.7, "平开窗平方数": 0, "推拉窗开扇个数": 0, "平开窗开扇个数": 0, "转方角米数": 0},
}

# 定义价格参数
# TODO 价格
prices = {
    "推拉窗每平方价格": 1680,
    "平开窗每平方价格": 799,
    "推拉窗开扇价格": 0,
    "平开窗开扇价格": 1380,
    "转方角每米价格": 300,
}
# TODO 额外费用(吊装费)
others = 450 + 2500


# 冠豪
# prices = {
#     "推拉窗每平方价格": 1680,
#     "平开窗每平方价格": 799,
#     "推拉窗开扇价格": 0,
#     "平开窗开扇价格": 799,
#     "转方角每米价格": 300,
# }


def load_data():
    try:
        with open("window_data.json", "r", encoding="utf-8") as f:
            data = json.load(f)
            return data["windows"], data["prices"]
    except FileNotFoundError:
        return windows, prices

def calculate_total_price():
    total = 0
    for location, params in windows.items():
        location_total = (
            params["推拉窗平方数"] * prices["推拉窗每平方价格"] +
            params["平开窗平方数"] * prices["平开窗每平方价格"] +
            params["推拉窗开扇个数"] * prices["推拉窗开扇价格"] +
            params["平开窗开扇个数"] * prices["平开窗开扇价格"] +
            params["转方角米数"] * prices["转方角每米价格"]
        )
        total += location_total
        print(f"{location}: {location_total:.2f}")
    total += others
    print(f"\n总价: {total:.2f}")

def main():
    global windows, prices
    windows, prices = load_data()
    calculate_total_price()

if __name__ == "__main__":
    main()